#### 📖 Terraform Plan ('src/domains/bonus/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_management_lock.st_gwc_01 will be destroyed
  # (because azurerm_management_lock.st_gwc_01 is not in configuration)
  - resource "azurerm_management_lock" "st_gwc_01" {
      - id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/providers/Microsoft.Authorization/locks/iopgwcbonusbackupst01" -> null
      - lock_level = "CanNotDelete" -> null
      - name       = "iopgwcbonusbackupst01" -> null
      - scope      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_management_lock.st_itn_01 will be destroyed
  # (because azurerm_management_lock.st_itn_01 is not in configuration)
  - resource "azurerm_management_lock" "st_itn_01" {
      - id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/providers/Microsoft.Authorization/locks/iopitnbonusbackupst01" -> null
      - name       = "iopitnbonusbackupst01" -> null
      - notes      = "Data is immutable and offline, and should not be read or modified" -> null
      - scope      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01" -> null
    }

  # azurerm_role_assignment.blob_data_owner_gwc_01 will be destroyed
  # (because azurerm_role_assignment.blob_data_owner_gwc_01 is not in configuration)
  - resource "azurerm_role_assignment" "blob_data_owner_gwc_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/8aed5e73-a5bb-8915-54f7-9f5846006c6e" -> null
      - name                                   = "8aed5e73-a5bb-8915-54f7-9f5846006c6e" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.blob_data_owner_itn_01 will be destroyed
  # (because azurerm_role_assignment.blob_data_owner_itn_01 is not in configuration)
  - resource "azurerm_role_assignment" "blob_data_owner_itn_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/4d005138-95e7-4ff8-f0ac-8b31f637f714" -> null
      - name                                   = "4d005138-95e7-4ff8-f0ac-8b31f637f714" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name                   = "Storage Blob Data Owner" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.queue_data_contributor_gwc_01 will be destroyed
  # (because azurerm_role_assignment.queue_data_contributor_gwc_01 is not in configuration)
  - resource "azurerm_role_assignment" "queue_data_contributor_gwc_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/ab7b1559-11ba-d978-90c1-7653f6ba3dda" -> null
      - name                                   = "ab7b1559-11ba-d978-90c1-7653f6ba3dda" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name                   = "Storage Queue Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.queue_data_contributor_itn_01 will be destroyed
  # (because azurerm_role_assignment.queue_data_contributor_itn_01 is not in configuration)
  - resource "azurerm_role_assignment" "queue_data_contributor_itn_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/f8279497-bb12-8669-6032-b7c49facc622" -> null
      - name                                   = "f8279497-bb12-8669-6032-b7c49facc622" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name                   = "Storage Queue Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.table_data_contributor_gwc_01 will be destroyed
  # (because azurerm_role_assignment.table_data_contributor_gwc_01 is not in configuration)
  - resource "azurerm_role_assignment" "table_data_contributor_gwc_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/7dbef6b6-9060-081f-d72c-973795a3d946" -> null
      - name                                   = "7dbef6b6-9060-081f-d72c-973795a3d946" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.table_data_contributor_itn_01 will be destroyed
  # (because azurerm_role_assignment.table_data_contributor_itn_01 is not in configuration)
  - resource "azurerm_role_assignment" "table_data_contributor_itn_01" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/providers/Microsoft.Authorization/roleAssignments/62c392d9-c3bd-9e10-1729-3e3e6cbdbf11" -> null
      - name                                   = "62c392d9-c3bd-9e10-1729-3e3e6cbdbf11" -> null
      - principal_id                           = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/0a9a7e1f-b9d0-4cc4-a60d-0319b160aaa3" -> null
      - role_definition_name                   = "Storage Table Data Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.bonus_backup_gwc_01 must be replaced
-/+ resource "azurerm_storage_account" "bonus_backup_gwc_01" {
      ~ access_tier                        = "Cold" -> "Cool"
      ~ account_replication_type           = "LRS" -> "ZRS" # forces replacement
      ~ allow_nested_items_to_be_public    = false -> true
      - allowed_copy_scope                 = "AAD" -> null
      ~ id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
        name                               = "iopgwcbonusbackupst01"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://iopgwcbonusbackupst01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "iopgwcbonusbackupst01.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://iopgwcbonusbackupst01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "iopgwcbonusbackupst01.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://iopgwcbonusbackupst01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "iopgwcbonusbackupst01.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "germanywestcentral" -> (known after apply)
      ~ primary_queue_endpoint             = "https://iopgwcbonusbackupst01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "iopgwcbonusbackupst01.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://iopgwcbonusbackupst01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "iopgwcbonusbackupst01.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://iopgwcbonusbackupst01.z1.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "iopgwcbonusbackupst01.z1.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ public_network_access_enabled      = false -> true
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Bonus & Pagamenti"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/bonus/prod"
        }
        # (18 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)

          + restore_policy {
              + days = 5
            }

            # (2 unchanged blocks hidden)
        }

      ~ network_rules (known after apply)
      - network_rules {
          - bypass                     = [
              - "AzureServices",
              - "Logging",
              - "Metrics",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

  # azurerm_storage_account.bonus_backup_itn_01 will be updated in-place
  ~ resource "azurerm_storage_account" "bonus_backup_itn_01" {
      ~ access_tier                        = "Cold" -> "Cool"
      ~ allow_nested_items_to_be_public    = false -> true
      - allowed_copy_scope                 = "AAD" -> null
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
        name                               = "iopitnbonusbackupst01"
      ~ public_network_access_enabled      = false -> true
        tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Bonus & Pagamenti"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/bonus/prod"
        }
        # (92 unchanged attributes hidden)

      ~ blob_properties {
            # (5 unchanged attributes hidden)

          + restore_policy {
              + days = 5
            }

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_container.bonus_activations_gwc_01 will be created
  + resource "azurerm_storage_container" "bonus_activations_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-activations"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.bonus_activations_itn_01 will be created
  + resource "azurerm_storage_container" "bonus_activations_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-activations"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.bonus_gwc_01 must be replaced
-/+ resource "azurerm_storage_container" "bonus_gwc_01" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = true -> (known after apply)
      ~ id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/bonus" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "bonus"
      ~ resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/bonus" -> (known after apply)
      ~ storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.bonus_leases_gwc_01 will be created
  + resource "azurerm_storage_container" "bonus_leases_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-leases"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.bonus_leases_itn_01 will be created
  + resource "azurerm_storage_container" "bonus_leases_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-leases"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.bonus_processing_gwc_01 will be created
  + resource "azurerm_storage_container" "bonus_processing_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-processing"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.bonus_processing_itn_01 will be created
  + resource "azurerm_storage_container" "bonus_processing_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bonus-processing"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.change_feed_leases_gwc_01 will be created
  + resource "azurerm_storage_container" "change_feed_leases_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "change-feed-leases"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.change_feed_leases_itn_01 will be created
  + resource "azurerm_storage_container" "change_feed_leases_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "change-feed-leases"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.cosmosdb_gwc_01 will be destroyed
  # (because azurerm_storage_container.cosmosdb_gwc_01 is not in configuration)
  - resource "azurerm_storage_container" "cosmosdb_gwc_01" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/cosmosdb" -> null
      - metadata                          = {} -> null
      - name                              = "cosmosdb" -> null
      - resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/cosmosdb" -> null
      - storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> null
    }

  # azurerm_storage_container.cosmosdb_itn_01 will be destroyed
  # (because azurerm_storage_container.cosmosdb_itn_01 is not in configuration)
  - resource "azurerm_storage_container" "cosmosdb_itn_01" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/blobServices/default/containers/cosmosdb" -> null
      - metadata                          = {} -> null
      - name                              = "cosmosdb" -> null
      - resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/blobServices/default/containers/cosmosdb" -> null
      - storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01" -> null
    }

  # azurerm_storage_container.eligibility_checks_gwc_01 will be created
  + resource "azurerm_storage_container" "eligibility_checks_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "eligibility-checks"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.eligibility_checks_itn_01 will be created
  + resource "azurerm_storage_container" "eligibility_checks_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "eligibility-checks"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_container.redeemed_requests_gwc_01 must be replaced
-/+ resource "azurerm_storage_container" "redeemed_requests_gwc_01" {
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = true -> (known after apply)
      ~ id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/redeemed-requests" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "redeemed-requests"
      ~ resource_manager_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/blobServices/default/containers/redeemed-requests" -> (known after apply)
      ~ storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_container.user_bonuses_gwc_01 will be created
  + resource "azurerm_storage_container" "user_bonuses_gwc_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "user-bonuses"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.user_bonuses_itn_01 will be created
  + resource "azurerm_storage_container" "user_bonuses_itn_01" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "user-bonuses"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01"
    }

  # azurerm_storage_object_replication.itn_01_to_gwc_01 must be replaced
-/+ resource "azurerm_storage_object_replication" "itn_01_to_gwc_01" {
      ~ destination_object_replication_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/objectReplicationPolicies/15509b6a-eefe-404d-aa5f-63a186925048" -> (known after apply)
      ~ destination_storage_account_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply) # forces replacement
      ~ id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/objectReplicationPolicies/15509b6a-eefe-404d-aa5f-63a186925048;/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01/objectReplicationPolicies/15509b6a-eefe-404d-aa5f-63a186925048" -> (known after apply)
      ~ source_object_replication_id      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnbonusbackupst01/objectReplicationPolicies/15509b6a-eefe-404d-aa5f-63a186925048" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rules {
          - copy_blobs_created_after     = "Everything" -> null
          - destination_container_name   = "bonus" -> null
          - filter_out_blobs_with_prefix = [] -> null
          - name                         = "be5b48b5-bea7-490e-9b3a-126e7565dfe8" -> null
          - source_container_name        = "bonus" -> null
        }
      - rules {
          - copy_blobs_created_after     = "Everything" -> null
          - destination_container_name   = "cosmosdb" -> null
          - filter_out_blobs_with_prefix = [] -> null
          - name                         = "e658f926-a89e-4d54-b1ab-debed6964f00" -> null
          - source_container_name        = "cosmosdb" -> null
        }
      - rules {
          - copy_blobs_created_after     = "Everything" -> null
          - destination_container_name   = "redeemed-requests" -> null
          - filter_out_blobs_with_prefix = [] -> null
          - name                         = "f7ed0cf2-6d2c-4380-a342-ebcd6cc9f494" -> null
          - source_container_name        = "redeemed-requests" -> null
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "bonus"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "bonus"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "bonus-activations"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "bonus-activations"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "bonus-leases"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "bonus-leases"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "bonus-processing"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "bonus-processing"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "change-feed-leases"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "change-feed-leases"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "eligibility-checks"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "eligibility-checks"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "redeemed-requests"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "redeemed-requests"
        }
      + rules {
          + copy_blobs_created_after     = "Everything"
          + destination_container_name   = "user-bonuses"
          + filter_out_blobs_with_prefix = []
          + name                         = (known after apply)
          + source_container_name        = "user-bonuses"
        }
    }

Plan: 16 to add, 1 to change, 14 to destroy.

Changes to Outputs:
  ~ storage_account_secondary = {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-bonus-rg-01/providers/Microsoft.Storage/storageAccounts/iopgwcbonusbackupst01" -> (known after apply)
        name                = "iopgwcbonusbackupst01"
        # (1 unchanged attribute hidden)
    }

Error: retrieving Table "bonusactivations" (Account "Account \"iopgwcbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "eligibilitychecks" (Account "Account \"iopgwcbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "redeemederrors" (Account "Account \"iopitnbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "adelogs" (Account "Account \"iopitnbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "bonusleasebindings" (Account "Account \"iopitnbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "opsActiveBonusSentMsgStatus" (Account "Account \"iopgwcbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "opsActiveBonusSentMsgStatus" (Account "Account \"iopitnbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "bonusactivations" (Account "Account \"iopitnbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "inpslogs" (Account "Account \"iopgwcbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "redeemederrors" (Account "Account \"iopgwcbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "eligibilitychecks" (Account "Account \"iopitnbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "adelogs" (Account "Account \"iopgwcbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "bonusleasebindings" (Account "Account \"iopgwcbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF


Error: retrieving Table "inpslogs" (Account "Account \"iopitnbonusbackupst01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"table\" / DomainSuffix \"core.windows.net\")"): executing request: unexpected status 403 (403 Forbidden) with EOF

::error::Terraform exited with code 1.
```

</details>
